load-ddos.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 100
      rampTo: 200
  payload:
    path: "users.csv"
    fields:
      - "username"
      - "password"
    order: "random"
    reuse: false
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Stress test login et actions"
    flow:
      - post:
          url: "/players/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 200
      - get:
          url: "/players/me"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/players/score"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            score: 999999
          expect:
            - statusCode: 200